# GetTexSpace2DScale

## Description
Function GetTexSpace2DScale returns the 2D scale for the referenced texture space.

```pascal
FUNCTION GetTexSpace2DScale(textureSpace : HANDLE) : REAL;
```

```python

def vs.GetTexSpace2DScale(textureSpace):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|

## Remarks
Gets the 2D scale for this texture space as a multiple of a default size of 1.

## Version
```diff
- GetTexSpace2DScale is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures